## Fetching Dataset

In [1]:
# from google.colab import drive

# drive.mount("/content/drive")

In [2]:
import numpy as np, pandas as pd

In [3]:
dataset = pd.read_csv("Datasets/Social_Network_Ads.csv")

In [4]:
dataset.head(5)

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [5]:
dataset.tail(5)

      User ID  Gender  Age  EstimatedSalary  Purchased
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

In [6]:
dataset

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [7]:
dataset.rename(columns={"User ID": "UserID"}, inplace=True)

In [8]:
dataset.shape

(400, 5)

In [9]:
print("The dataset has a total of " + str(dataset.shape[0]) + " rows and " + str(dataset.shape[1]) + " columns.")

The dataset has a total of 400 rows and 5 columns.

In [10]:
dat_columns = dataset.columns
dat_columns

Index(['UserID', 'Gender', 'Age', 'EstimatedSalary', 'Purchased'], dtype='object')

## Investigating Dataset

In [11]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   UserID           400 non-null    int64
 1   Gender           400 non-null    object
 2   Age              400 non-null    int64
 3   EstimatedSalary  400 non-null    int64
 4   Purchased        400 non-null    int64
dtypes: int64(4), object(1)
memory usage: 15.8+ KB

In [12]:
dataset.isna().sum()
# dataset.isnull().sum()

UserID             0
Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

In [13]:
# dataset = dataset.dropna()
# Or imputation methods can be applied

In [14]:
dataset.duplicated().sum()

0

In [15]:
# dataset = dataset.drop_duplicates()

In [16]:
dataset.dtypes

UserID              int64
Gender             object
Age                 int64
EstimatedSalary     int64
Purchased           int64
dtype: object

In [17]:
dataset.describe()

             UserID         Age  EstimatedSalary   Purchased
count  4.000000e+02  400.000000       400.000000  400.000000
mean   1.569154e+07   37.655000     69742.500000    0.357500
std    7.165832e+04   10.482877     34096.960282    0.479864
min    1.556669e+07   18.000000     15000.000000    0.000000
25%    1.562676e+07   29.750000     43000.000000    0.000000
50%    1.569434e+07   37.000000     70000.000000    0.000000
75%    1.575036e+07   46.000000     88000.000000    1.000000
max    1.581524e+07   60.000000    150000.000000    1.000000

In [18]:
dataset["Age"].mean()

37.655

In [19]:
dataset.nunique()

UserID             400
Gender               2
Age                 43
EstimatedSalary    117
Purchased            2
dtype: int64

In [20]:
dataset["Gender"].value_counts()

Female    204
Male      196
Name: Gender, dtype: int64

In [21]:
dataset["Purchased"].value_counts()

0    257
1    143
Name: Purchased, dtype: int64

In [22]:
dataset[(dataset["Gender"] == "Male") & (dataset["Purchased"] == 0)]

       UserID Gender  Age  EstimatedSalary  Purchased
0    15624510   Male   19            19000          0
1    15810944   Male   35            20000          0
4    15804002   Male   19            76000          0
5    15728773   Male   27            58000          0
8    15600575   Male   25            33000          0
..        ...    ...  ...              ...        ...
359  15709183   Male   42            54000          0
368  15779744   Male   38            71000          0
380  15683758   Male   42            64000          0
387  15627220   Male   39            71000          0
398  15755018   Male   36            33000          0

[130 rows x 5 columns]

In [23]:
dataset[["Gender", "Purchased"]][(dataset["Gender"] == "Male") & (dataset["Purchased"] == 0)].value_counts()

Gender  Purchased
Male    0            130
dtype: int64

In [24]:
dataset.to_csv("Datasets/Social_Network_Ads_Cleaned.csv", index = False)